#include "std.h"

void MyPrint::Logo() {
	system("cls");
	cout << "************************************************************************" << endl;
	cout << "2025학년도 1학기" << endl;
	cout << "C++ 언어 회원 관리 프로그램" << endl;
	cout << "2025-07-16" << endl;
	cout << "오승하" << endl;
	cout << "************************************************************************" << endl;
	system("pause");
}

char MyPrint::Menu() {
	cout << "************************************************************************" << endl;
	cout << "[1] 회원 저장(insert)" << endl;
	cout << "[2] 회원 검색(select)" << endl;
	cout << "[3] 회원 수정(update)" << endl;
	cout << "[4] 회원 삭제(delete)" << endl;
	cout << "[5] 프로그램 종료(exit)" << endl;
	cout << "************************************************************************" << endl;
	return _getch();
}

void MyPrint::Ending() {
	system("cls");
	cout << "************************************************************************" << endl;
	cout << "프로그램을 종료합니다." << endl;
	cout << "************************************************************************" << endl;
	system("pause");
}