#include "std.h"

void MyPrint::Logo() {
	system("cls");
	cout << "************************************************************************" << endl;
	cout << "2025학년도 1학기" << endl;
	cout << "C++ 언어 계좌 관리 프로그램" << endl;
	cout << "2025-07-22" << endl;
	cout << "오승하" << endl;
	cout << "************************************************************************" << endl;
	system("pause");
}

char MyPrint::Menu() {
	cout << "************************************************************************" << endl;
	cout << "[1] 계좌 생성(insert)" << endl;
	cout << "[2] 계좌 검색(select)" << endl;
	cout << "[3] 입금(update)" << endl;
	cout << "[4] 출금(update)" << endl;
	cout << "[5] 계좌 삭제(delete)" << endl;
	cout << "[6] 프로그램 종료(exit)" << endl;
	cout << "************************************************************************" << endl;
	return _getch();
}

void MyPrint::Ending() {
	system("cls");
	cout << "************************************************************************" << endl;
	cout << "프로그램을 종료합니다." << endl;
	cout << "************************************************************************" << endl;
	system("pause");
}